In [1]:
import urllib.parse
import numpy as np
import pandas as pd
%load_ext sql
%config SqlMagic.displaylimit = 20
%config SqlMagic.autolimit = 30

login = {
    "host": "localhost",
    "port": 5432,
    "user": "postgres",
    "password": "gufeng2002"
  }

username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

In [2]:
%sql postgresql://{username}:{password}@{host}:{port}/dvdrental

'Connected: postgres@dvdrental'

In [3]:
%%sql

SELECT 
    * 
FROM
    information_schema.tables 
WHERE 
    table_schema = 'public'
    AND
    table_type = 'BASE TABLE'
;

 * postgresql://postgres:***@localhost:5432/dvdrental
38 rows affected.

[('dvdrental', 'public', 'accounts', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'actor', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'store', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'address', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'category', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'city', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'country', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'customer', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'film_actor', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'film_category', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'inventory', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'language', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'staff', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'payment', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'rental', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'film', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'departments2', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'employees2', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'employee', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'project', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'rate', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'books3', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'books', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'another_table', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'authors', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'phone_numbers2', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'courses', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'enrollment', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'student', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None),
 ('dvdrental', 'public', 'course', 'BASE TABLE', None, None, None, None, None, 'YES', 'NO', None)]

In [17]:
%%sql

SELECT column_name, data_type, udt_name, is_nullable, column_default
     FROM information_schema.columns
     WHERE table_name = 'actor'

 * postgresql://postgres:***@localhost:5432/dvdrental
4 rows affected.

[('actor_id', 'integer', 'int4', 'NO', "nextval('actor_actor_id_seq'::regclass)"),
 ('first_name', 'character varying', 'varchar', 'NO', None),
 ('last_name', 'character varying', 'varchar', 'NO', None),
 ('last_update', 'timestamp without time zone', 'timestamp', 'NO', 'now()')]

In [25]:
%%sql

-- print out the first 5 rows in a table
SELECT * FROM payment 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (17507, 341, 2, 3130, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577))]

In [28]:
%%sql

-- convert data type
SELECT CAST(1.234 AS BIGINT) AS converted_integer;

SELECT CAST(amount AS INT) AS int_amount
FROM payment
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
5 rows affected.

[(8,), (2,), (8,), (3,), (8,)]

In [38]:
%%sql 

SELECT 
    'False':: BOOLEAN AS bool1,
    'No':: BOOLEAN AS bool2,
    'f':: BOOLEAN AS bool3
;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(False, False, False)]

In [45]:
%%sql

SELECT staff_id, payment_id, customer_id, amount 
FROM payment
-- WHERE staff_id = 1 OR staff_id = 5 # specifc condition
WHERE amount < 10 AND amount > 5
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2, 17503, 341, Decimal('7.99')),
 (1, 17505, 341, Decimal('7.99')),
 (2, 17507, 341, Decimal('7.99')),
 (1, 17508, 341, Decimal('5.99')),
 (2, 17509, 342, Decimal('5.99'))]

In [48]:
%%sql

SELECT staff_id, payment_id, customer_id, amount 
FROM payment
-- WHERE staff_id = 1 OR staff_id = 5
WHERE amount < 10 AND staff_id = 1 -- multiple conditions
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 17504, 341, Decimal('1.99')),
 (1, 17505, 341, Decimal('7.99')),
 (1, 17508, 341, Decimal('5.99')),
 (1, 17510, 342, Decimal('5.99')),
 (1, 17511, 342, Decimal('2.99'))]

In [56]:
%%sql

-- using "LIKE" for string pattern matching
SELECT * FROM customer
-- use '%' to represt infinite string number before a specific string
WHERE first_name LIKE '%ed' AND last_name LIKE '__y' -- use '_' to represent an arbitrary 
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [64]:
%%sql

-- use BETWEEN for range filtering 
SELECT * FROM payment
WHERE payment_date BETWEEN '2007-3-2 18:30:00' AND '2008-3-2'
ORDER BY payment_date
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(20797, 403, 2, 11427, Decimal('2.99'), datetime.datetime(2007, 3, 2, 18, 31, 5, 996577)),
 (20058, 326, 2, 11428, Decimal('2.99'), datetime.datetime(2007, 3, 2, 18, 31, 36, 996577)),
 (20269, 348, 1, 11429, Decimal('7.99'), datetime.datetime(2007, 3, 2, 18, 32, 18, 996577)),
 (23999, 140, 2, 11430, Decimal('3.99'), datetime.datetime(2007, 3, 2, 18, 33, 2, 996577)),
 (19563, 271, 1, 11431, Decimal('2.99'), datetime.datetime(2007, 3, 2, 18, 33, 42, 996577)),
 (22099, 540, 2, 11432, Decimal('6.99'), datetime.datetime(2007, 3, 2, 18, 38, 27, 996577)),
 (21895, 518, 2, 11433, Decimal('3.99'), datetime.datetime(2007, 3, 2, 18, 41, 36, 996577)),
 (20691, 391, 2, 11434, Decimal('2.99'), datetime.datetime(2007, 3, 2, 18, 41, 40, 996577)),
 (21746, 502, 1, 11435, Decimal('0.99'), datetime.datetime(2007, 3, 2, 18, 42, 49, 996577)),
 (23670, 106, 2, 11436, Decimal('0.99'), datetime.datetime(2007, 3, 2, 18, 44, 32, 996577))]

In [66]:
%%sql

-- use BETWEEN for range filtering 
SELECT * FROM payment
WHERE amount BETWEEN 3 AND 6
ORDER BY amount
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(32025, 43, 2, 15644, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (31969, 457, 1, 12645, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (31965, 448, 2, 14734, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (32014, 15, 1, 13798, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (32065, 175, 2, 14060, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (32088, 228, 2, 12672, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (31919, 269, 1, 13025, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (31945, 361, 1, 13298, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577)),
 (17651, 380, 1, 1868, Decimal('3.99'), datetime.datetime(2007, 2, 17, 0, 31, 48, 996577)),
 (17639, 377, 2, 2556, Decimal('3.99'), datetime.datetime(2007, 2, 19, 1, 35, 58, 996577))]

In [69]:
%%sql

-- use in for range Set Membership 
SELECT * FROM payment
WHERE rental_id IN ('2556', '1868', '13025')
ORDER BY payment_date
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(17651, 380, 1, 1868, Decimal('3.99'), datetime.datetime(2007, 2, 17, 0, 31, 48, 996577)),
 (17639, 377, 2, 2556, Decimal('3.99'), datetime.datetime(2007, 2, 19, 1, 35, 58, 996577)),
 (31919, 269, 1, 13025, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

In [71]:
%%sql

-- use in for range Set Membership 
SELECT * FROM payment
WHERE rental_id ='2556' OR rental_id = '1868' OR rental_id = '13025'
ORDER BY payment_date
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(17651, 380, 1, 1868, Decimal('3.99'), datetime.datetime(2007, 2, 17, 0, 31, 48, 996577)),
 (17639, 377, 2, 2556, Decimal('3.99'), datetime.datetime(2007, 2, 19, 1, 35, 58, 996577)),
 (31919, 269, 1, 13025, Decimal('3.98'), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

In [78]:
%%sql

-- checking for NULL values
SELECT * FROM customer 
WHERE email IS NOT NULL
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (2, 1, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (3, 1, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (4, 2, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [85]:
%%sql

-- generate new column from expression
SELECT 
CONCAT(first_name, last_name) AS full_name, 
last_update, (now() - last_update) AS rental_duration
FROM customer
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('JaredEly', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('MarySmith', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('PatriciaJohnson', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('LindaWilliams', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('BarbaraJones', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('ElizabethBrown', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('JenniferDavis', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('MariaMiller', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('SusanWilson', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003)),
 ('MargaretMoore', datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), datetime.timedelta(days=4208, seconds=38767, microseconds=551003))]

## Lec5 Common functions and operators

In [100]:
%%sql

-- numeric functions
SELECT 
    25 * 2 AS first_column,
    ABS(10 - 12), 
    ROUND(3.1415926, 4),
    SQRT(5),
    LOG(ROUND(3.1415926, 5));

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(50, 2, Decimal('3.1416'), 2.23606797749979, Decimal('0.4971495058611233'))]

In [110]:
%%sql

-- string functions
SELECT 
    CONCAT(first_name, ' ', last_name) AS full_name,
    LENGTH(first_name) AS first_name_length,
    UPPER(last_name) AS upper_last_name,
    INITCAP(email) AS initcap_name
FROM customer
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('Jared Ely', 5, 'ELY', 'Jared.Ely@Sakilacustomer.Org'),
 ('Mary Smith', 4, 'SMITH', 'Mary.Smith@Sakilacustomer.Org'),
 ('Patricia Johnson', 8, 'JOHNSON', 'Patricia.Johnson@Sakilacustomer.Org'),
 ('Linda Williams', 5, 'WILLIAMS', 'Linda.Williams@Sakilacustomer.Org'),
 ('Barbara Jones', 7, 'JONES', 'Barbara.Jones@Sakilacustomer.Org'),
 ('Elizabeth Brown', 9, 'BROWN', 'Elizabeth.Brown@Sakilacustomer.Org'),
 ('Jennifer Davis', 8, 'DAVIS', 'Jennifer.Davis@Sakilacustomer.Org'),
 ('Maria Miller', 5, 'MILLER', 'Maria.Miller@Sakilacustomer.Org'),
 ('Susan Wilson', 5, 'WILSON', 'Susan.Wilson@Sakilacustomer.Org'),
 ('Margaret Moore', 8, 'MOORE', 'Margaret.Moore@Sakilacustomer.Org')]

In [115]:
%%sql

-- string functions
SELECT 
    first_name,
    SUBSTRING(first_name, 1, 3) AS name_substring,
    REPLACE(first_name, 'a', 'A') AS replaced_name,
    LPAD(first_name, 10, '*') AS left_padded_name
FROM customer
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[('Jared', 'Jar', 'JAred', '*****Jared'),
 ('Mary', 'Mar', 'MAry', '******Mary'),
 ('Patricia', 'Pat', 'PAtriciA', '**Patricia'),
 ('Linda', 'Lin', 'LindA', '*****Linda'),
 ('Barbara', 'Bar', 'BArbArA', '***Barbara'),
 ('Elizabeth', 'Eli', 'ElizAbeth', '*Elizabeth'),
 ('Jennifer', 'Jen', 'Jennifer', '**Jennifer'),
 ('Maria', 'Mar', 'MAriA', '*****Maria'),
 ('Susan', 'Sus', 'SusAn', '*****Susan'),
 ('Margaret', 'Mar', 'MArgAret', '**Margaret')]

In [118]:
%%sql

-- date and time functions
SELECT 
    CURRENT_DATE AS current_date,
    CURRENT_TIMESTAMP AS current_timestamp,
    NOW() AS current_datetime;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(datetime.date(2024, 12, 3), datetime.datetime(2024, 12, 3, 0, 48, 50, 364075, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))), datetime.datetime(2024, 12, 3, 0, 48, 50, 364075, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=57600))))]

In [121]:
%%sql

-- date, time functions
SELECT rental_id, rental_date,
    EXTRACT(YEAR FROM rental_date) AS rental_year,
    AGE(NOW(), rental_date) AS rental_duration
FROM rental
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(100, datetime.datetime(2005, 5, 25, 16, 50, 28), Decimal('2005'), datetime.timedelta(days=7123, seconds=28823, microseconds=254157)),
 (101, datetime.datetime(2005, 5, 25, 17, 17, 4), Decimal('2005'), datetime.timedelta(days=7123, seconds=27227, microseconds=254157)),
 (102, datetime.datetime(2005, 5, 25, 17, 22, 10), Decimal('2005'), datetime.timedelta(days=7123, seconds=26921, microseconds=254157)),
 (103, datetime.datetime(2005, 5, 25, 17, 30, 42), Decimal('2005'), datetime.timedelta(days=7123, seconds=26409, microseconds=254157)),
 (104, datetime.datetime(2005, 5, 25, 17, 46, 33), Decimal('2005'), datetime.timedelta(days=7123, seconds=25458, microseconds=254157)),
 (105, datetime.datetime(2005, 5, 25, 17, 54, 12), Decimal('2005'), datetime.timedelta(days=7123, seconds=24999, microseconds=254157)),
 (106, datetime.datetime(2005, 5, 25, 18, 18, 19), Decimal('2005'), datetime.timedelta(days=7123, seconds=23552, microseconds=254157)),
 (107, datetime.datetime(2005, 5, 25, 18, 28, 9), Decimal('2005'), datetime.timedelta(days=7123, seconds=22962, microseconds=254157)),
 (108, datetime.datetime(2005, 5, 25, 18, 30, 5), Decimal('2005'), datetime.timedelta(days=7123, seconds=22846, microseconds=254157)),
 (109, datetime.datetime(2005, 5, 25, 18, 40, 20), Decimal('2005'), datetime.timedelta(days=7123, seconds=22231, microseconds=254157))]

In [1]:
%%sql

-- timestamp funcitons
SELECT rental_id, (rental_date + INTERVAL '1 YEAR') AS rental_next_year
FROM rental 
LIMIT 10;

UsageError: Cell magic `%%sql` not found.

In [134]:
%%sql

-- Aggregation functions
SELECT COUNT(*), MIN(amount), MAX(amount), SUM(amount), ROUND(AVG(amount),4) -- apply on whole table
FROM payment
LIMIT 10

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(14596, Decimal('0.00'), Decimal('11.99'), Decimal('61312.04'), Decimal('4.2006'))]

In [8]:
%%sql

-- Aggregation functions
SELECT COUNT(*), MIN(amount), MAX(amount), SUM(amount), ROUND(AVG(amount),4) -- apply on subset of table
FROM payment
WHERE staff_id = 1
LIMIT 10;

SELECT COUNT(*), MIN(amount), MAX(amount), SUM(amount), ROUND(AVG(amount),4) -- apply on subset of table
FROM payment
WHERE staff_id = 2
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
1 rows affected.

[(7304, Decimal('0.00'), Decimal('11.99'), Decimal('31059.92'), Decimal('4.2525'))]

In [22]:
%%sql

-- a little complicated statistics
SELECT STDDEV(amount), REGR_R2(amount, amount * 0.8) -- apply on whole table
FROM payment
WHERE staff_id = 1
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(Decimal('2.3657470940165390'), 1.000000000000002)]

In [28]:
%%sql

-- summarize by each customer
SELECT AVG(amount), customer_id
FROM payment
WHERE customer_id < 187
GROUP BY customer_id
ORDER BY avg DESC
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(Decimal('5.4900000000000000'), 19),
 (Decimal('5.4483333333333333'), 3),
 (Decimal('5.0809090909090909'), 181),
 (Decimal('5.0426315789473684'), 137),
 (Decimal('4.9900000000000000'), 22),
 (Decimal('4.9900000000000000'), 178),
 (Decimal('4.9900000000000000'), 59),
 (Decimal('4.9483333333333333'), 82),
 (Decimal('4.9185714285714286'), 87),
 (Decimal('4.8900000000000000'), 65)]

In [31]:
%%sql

SELECT customer_id, COUNT(*)
FROM payment
GROUP BY customer_id
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(1, 30),
 (2, 26),
 (3, 24),
 (4, 22),
 (5, 35),
 (6, 25),
 (7, 28),
 (8, 23),
 (9, 20),
 (10, 24)]

In [38]:
%%sql

-- HAVING clause for groups
SELECT customer_id, AVG(amount) as avg_amount
FROM payment
WHERE staff_id = 1
GROUP BY customer_id
HAVING AVG(amount) > 5 -- have to use expression, not alias, in the HAVING expression
ORDER BY avg_amount
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(403, Decimal('5.0525000000000000')),
 (21, Decimal('5.0525000000000000')),
 (421, Decimal('5.0614285714285714')),
 (571, Decimal('5.0669230769230769')),
 (346, Decimal('5.0669230769230769')),
 (295, Decimal('5.0669230769230769')),
 (495, Decimal('5.0733333333333333')),
 (63, Decimal('5.0733333333333333')),
 (176, Decimal('5.0809090909090909')),
 (577, Decimal('5.0900000000000000'))]

In [47]:
%%sql

SELECT NOW() - payment_date
FROM payment
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(datetime.timedelta(days=6500, seconds=10093, microseconds=963365),),
 (datetime.timedelta(days=6499, seconds=28245, microseconds=963365),),
 (datetime.timedelta(days=6499, seconds=9134, microseconds=963365),),
 (datetime.timedelta(days=6496, seconds=20043, microseconds=963365),),
 (datetime.timedelta(days=6495, seconds=27731, microseconds=963365),)]

In [56]:
%%sql

SELECT customer_id, COUNT(*) AS payment_count
FROM payment
WHERE amount > 5
GROUP BY customer_id
HAVING customer_id > 10
-- ORDER BY payment_count
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(11, 8),
 (12, 7),
 (13, 9),
 (14, 5),
 (15, 9),
 (16, 8),
 (17, 7),
 (18, 3),
 (19, 8),
 (20, 4)]

In [60]:
%%sql

-- group by on multi-levels
SELECT customer_id, staff_id, COUNT(*) AS payment_count
FROM payment
WHERE customer_id IN (1,2,3,4,5)
GROUP BY customer_id, staff_id
HAVING COUNT(*) > 5
ORDER BY customer_id, staff_id
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(1, 1, 15),
 (1, 2, 15),
 (2, 1, 14),
 (2, 2, 12),
 (3, 1, 12),
 (3, 2, 12),
 (4, 1, 12),
 (4, 2, 10),
 (5, 1, 14),
 (5, 2, 21)]

In [80]:
%%sql

-- drop the table if it exists
DROP TABLE IF EXISTS employees2;

CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT, 
    department VARCHAR(50)
);

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.

[]

In [81]:
%%sql

-- insert a tuple into the table
INSERT INTO employees2 (first_name, last_name, age, department) VALUES
    ('Feng', 'Gu', 22, 'Data Science');

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
1 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science')]

In [83]:
%%sql

-- insert a tuple with only some dimensions, not for all dimensions
INSERT INTO employees2 (first_name, last_name) VALUES 
    ('Haodong', 'Liu');

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
2 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science'), (2, 'Haodong', 'Liu', None, None)]

In [84]:
%%sql

INSERT INTO employees2 (first_name, last_name, age, department) 
VALUES ('Jane', 'Smith', 25, 'Marketing');

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[]

In [85]:
%%sql

-- insert multiple rows in a single statement
INSERT INTO employees2 (first_name, last_name, age, department)
VALUES 
    ('Alice', 'johnson', 28, 'Sales'),
    ('bob', 'brown', 35, 'HR'),
    ('charlie', 'davis', 40, 'Finance');

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.
6 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science'),
 (2, 'Haodong', 'Liu', None, None),
 (3, 'Jane', 'Smith', 25, 'Marketing'),
 (4, 'Alice', 'johnson', 28, 'Sales'),
 (5, 'bob', 'brown', 35, 'HR'),
 (6, 'charlie', 'davis', 40, 'Finance')]

In [89]:
%%sql

UPDATE employees2
SET first_name = INITCAP(first_name);

UPDATE employees2
SET last_name = INITCAP(last_name);

 * postgresql://postgres:***@localhost:5432/dvdrental
6 rows affected.
6 rows affected.

[]

In [90]:
%%sql

-- create another table
CREATE TABLE another_table (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT,
    department VARCHAR(50)
);

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.

[]

In [91]:
%%sql

-- insert some values into another table
INSERT INTO another_table 
    (first_name, last_name, age, department)
VALUES
    ('Emily', 'Clark', 29, 'Engineering'),
    ('Michael', 'Scott', 45, 'Engineering'),
    ('Pam', 'Beesly', 30, 'Sales');

SELECT * FROM another_table;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.
3 rows affected.

[(1, 'Emily', 'Clark', 29, 'Engineering'),
 (2, 'Michael', 'Scott', 45, 'Engineering'),
 (3, 'Pam', 'Beesly', 30, 'Sales')]

In [94]:
%%sql

-- insert values from another tables into the employees2
INSERT INTO employees2 (first_name, last_name, age, department)
SELECT first_name, last_name, age, department
FROM another_table
WHERE department = 'Engineering';

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[]

In [95]:
%%sql

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science'),
 (2, 'Haodong', 'Liu', None, None),
 (3, 'Jane', 'Smith', 25, 'Marketing'),
 (4, 'Alice', 'Johnson', 28, 'Sales'),
 (5, 'Bob', 'Brown', 35, 'HR'),
 (6, 'Charlie', 'Davis', 40, 'Finance'),
 (7, 'Emily', 'Clark', 29, 'Engineering'),
 (8, 'Michael', 'Scott', 45, 'Engineering'),
 (9, 'Emily', 'Clark', 29, 'Engineering'),
 (10, 'Michael', 'Scott', 45, 'Engineering')]

In [96]:
%%sql

-- CREATE a temporary table to verify our UPDATE operation first
CREATE TEMP TABLE temp_employees2 AS 
SELECT * FROM employees2;

SELECT * FROM temp_employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.
10 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science'),
 (2, 'Haodong', 'Liu', None, None),
 (3, 'Jane', 'Smith', 25, 'Marketing'),
 (4, 'Alice', 'Johnson', 28, 'Sales'),
 (5, 'Bob', 'Brown', 35, 'HR'),
 (6, 'Charlie', 'Davis', 40, 'Finance'),
 (7, 'Emily', 'Clark', 29, 'Engineering'),
 (8, 'Michael', 'Scott', 45, 'Engineering'),
 (9, 'Emily', 'Clark', 29, 'Engineering'),
 (10, 'Michael', 'Scott', 45, 'Engineering')]

In [97]:
%%sql

-- use UPDATE operation on this temporary table
UPDATE temp_employees2 
SET department = 'Constructure'
WHERE department = 'Engineering' AND age < 45
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(7, 'Emily', 'Clark', 29, 'Constructure'),
 (9, 'Emily', 'Clark', 29, 'Constructure')]

In [99]:
%%sql

-- use DELETE operation on this temporary table
DELETE FROM temp_employees2 
WHERE department IS NULL
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(2, 'Haodong', 'Liu', None, None)]

In [100]:
%%sql

-- after these two manipulations, let us have a look at the final table
SELECT * FROM temp_employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
9 rows affected.

[(1, 'Feng', 'Gu', 22, 'Data Science'),
 (3, 'Jane', 'Smith', 25, 'Marketing'),
 (4, 'Alice', 'Johnson', 28, 'Sales'),
 (5, 'Bob', 'Brown', 35, 'HR'),
 (6, 'Charlie', 'Davis', 40, 'Finance'),
 (8, 'Michael', 'Scott', 45, 'Engineering'),
 (10, 'Michael', 'Scott', 45, 'Engineering'),
 (7, 'Emily', 'Clark', 29, 'Constructure'),
 (9, 'Emily', 'Clark', 29, 'Constructure')]

## Data Definition Language

In [101]:
%%sql

-- set PRIMARY KEY and FOREIGN KEY in creating table
-- set constraints on some dimensions
DROP TABLE IF EXISTS employees2;
DROP TABLE IF EXISTS departments2;

CREATE TABLE departments2 (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) UNIQUE NOT NULL
);

CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT,
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments2 (id)
);

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
Done.
Done.

[]

In [103]:
%%sql

-- INSERT values into the two tables
INSERT INTO departments2 (name) 
VALUES
    ('Engineering'),
    ('Marketing'),
    ('Sales'),
    ('HR'),
    ('Finance'),
    ('IT')
RETURNING *; -- return rows that are minipulated

 * postgresql://postgres:***@localhost:5432/dvdrental
6 rows affected.

[(1, 'Engineering'),
 (2, 'Marketing'),
 (3, 'Sales'),
 (4, 'HR'),
 (5, 'Finance'),
 (6, 'IT')]

In [106]:
%%sql

INSERT INTO employees2 (first_name, last_name, age, department_id) 
VALUES 
    ('Jhon', 'Doe', 30, 1),
    ('Jane', 'Smith', 25, 2),
    ('Alice', 'Johnson', 28, 3),
    ('Bob', 'Brown', 35, 4),
    ('Charlie', 'Davis', 40, 5),
    ('David', 'Miller', 32, 6)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
6 rows affected.

[(1, 'Jhon', 'Doe', 30, 1),
 (2, 'Jane', 'Smith', 25, 2),
 (3, 'Alice', 'Johnson', 28, 3),
 (4, 'Bob', 'Brown', 35, 4),
 (5, 'Charlie', 'Davis', 40, 5),
 (6, 'David', 'Miller', 32, 6)]

In [107]:
%%sql

-- in the employees2 table, INSERT a tuple that has department_id not in the id of departments2 table
INSERT INTO employees2 (first_name, last_name, age, department_id)
VALUES 
    ('Feng', 'Gu', 22, '666') -- FOREIGN KEY VIOLATION
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental

IntegrityError: (psycopg2.errors.ForeignKeyViolation) insert or update on table "employees2" violates foreign key constraint "employees2_department_id_fkey"
DETAIL:  Key (department_id)=(666) is not present in table "departments2".

[SQL: -- in the employees2 table, INSERT a tuple that has department_id not in the id of departments2 table
INSERT INTO employees2 (first_name, last_name, age, department_id)
VALUES
    ('Feng', 'Gu', 22, '666')
RETURNING *;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [108]:
%%sql

-- in the employees2 table, INSERT a tuple that has department_id not in the id of departments2 table
INSERT INTO employees2 (first_name, last_name, age, department_id)
VALUES 
    ('Feng', 'Gu', 22, '6') -- NO VIOLATION
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(8, 'Feng', 'Gu', 22, 6)]

In [111]:
%%sql

-- check the UNIQUE constraint on department2 table
INSERT INTO departments2 (name) 
VALUES 
    ('IT') -- UNIQUE VIOLATION
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "departments2_name_key"
DETAIL:  Key (name)=(IT) already exists.

[SQL: -- check the UNIQUE constraint on department2 table
INSERT INTO departments2 (name)
VALUES
    ('IT')
RETURNING *;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [112]:
%%sql

-- check the UNIQUE constraint on department2 table
INSERT INTO departments2 (name) 
VALUES 
    ('DataScience') -- UNIQUE VIOLATION
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(8, 'DataScience')]

In [115]:
%%sql

UPDATE departments2
SET id = 7
WHERE name = 'DataScience'; -- adjust the id value for DataScience to make them consequtive

SELECT * FROM departments2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
7 rows affected.

[(1, 'Engineering'),
 (2, 'Marketing'),
 (3, 'Sales'),
 (4, 'HR'),
 (5, 'Finance'),
 (6, 'IT'),
 (7, 'DataScience')]

In [116]:
%%sql

INSERT INTO departments2 (name)
VALUES 
    (NULL);

SELECT * FROM departments2;

 * postgresql://postgres:***@localhost:5432/dvdrental

IntegrityError: (psycopg2.errors.NotNullViolation) null value in column "name" of relation "departments2" violates not-null constraint
DETAIL:  Failing row contains (9, null).

[SQL: INSERT INTO departments2 (name)
VALUES
    (NULL);]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [117]:
%%sql

INSERT INTO employees2 (age)
VALUES 
    (NULL);

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
8 rows affected.

[(1, 'Jhon', 'Doe', 30, 1),
 (2, 'Jane', 'Smith', 25, 2),
 (3, 'Alice', 'Johnson', 28, 3),
 (4, 'Bob', 'Brown', 35, 4),
 (5, 'Charlie', 'Davis', 40, 5),
 (6, 'David', 'Miller', 32, 6),
 (8, 'Feng', 'Gu', 22, 6),
 (9, None, None, None, None)]

In [118]:
%%sql

-- set DEFAULT values for a dimension
DROP TABLE IF EXISTS employees2;
CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT,
    department VARCHAR(50) DEFAULT 'General');

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.

[]

In [121]:
%%sql

INSERT INTO employees2 (age) 
VALUES
    (10);

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
2 rows affected.

[(1, None, None, None, None), (2, None, None, 10, 'General')]

In [126]:
%%sql

-- CREATE table with CHECK constraints
DROP TABLE IF EXISTS employees2;

CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT CHECK (age > 0 AND age < 100),
    department VARCHAR(50) DEFAULT 'General', 
    date_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
0 rows affected.

[]

In [130]:
%%sql

INSERT INTO employees2 (first_name, age)
VALUES
    ('Feng', 22),
    ('Liu', 1)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(4, 'Feng', None, 22, 'General', datetime.datetime(2024, 12, 3, 15, 3, 55, 379940)),
 (5, 'Liu', None, 1, 'General', datetime.datetime(2024, 12, 3, 15, 3, 55, 379940))]

In [142]:
%%sql

DROP TABLE IF EXISTS employees2;
DROP TABLE IF EXISTS departments2;

CREATE TABLE departments2 (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) UNIQUE
);

CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    full_name VARCHAR(50),
    age INT CHECK (age > 18 AND age <100),
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments2 (id)
    ON UPDATE CASCADE
    ON DELETE RESTRICT
);

-- insert values into the tables

INSERT INTO departments2 (name) VALUES
    ('Engineering'),
    ('Marketing')
RETURNING *;

INSERT INTO employees2 (full_name, age, department_id) VALUES
    ('John', 30, 1),
    ('Jane', 25, 2)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
Done.
Done.

[]

In [143]:
%%sql

-- insert values into the tables

INSERT INTO departments2 (name) VALUES
    ('Engineering'),
    ('Marketing')
RETURNING *;

INSERT INTO employees2 (full_name, age, department_id) VALUES
    ('John', 30, 1),
    ('Jane', 25, 2)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.
2 rows affected.

[(1, 'John', 30, 1), (2, 'Jane', 25, 2)]

In [144]:
%%sql

-- check the CASECADE and SET NULL modes on UPDATE and DELETE operation
UPDATE departments2
SET id = 3
WHERE id = 2
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(3, 'Marketing')]

In [146]:
%%sql

-- check the corresponding values in employees2 table
SELECT * FROM employees2; -- changed as wanted

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'John', 30, 1), (2, 'Jane', 25, 3)]

In [147]:
%%sql

-- check the CASECADE and SET NULL modes on UPDATE and DELETE operation
DELETE FROM departments2 -- restrict mode
WHERE id = 1
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental

IntegrityError: (psycopg2.errors.ForeignKeyViolation) update or delete on table "departments2" violates foreign key constraint "employees2_department_id_fkey" on table "employees2"
DETAIL:  Key (id)=(1) is still referenced from table "employees2".

[SQL: -- check the CASECADE and SET NULL modes on UPDATE and DELETE operation
DELETE FROM departments2
WHERE id = 1
RETURNING *;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [162]:
%%sql

DROP TABLE IF EXISTS employees2;
DROP TABLE IF EXISTS departments2;

CREATE TABLE departments2 (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) UNIQUE
);

CREATE TABLE employees2 (
    id SERIAL PRIMARY KEY,
    full_name VARCHAR(50),
    age INT CHECK (age > 18 AND age <100),
    department_id INT DEFAULT 404, 
    FOREIGN KEY (department_id) REFERENCES departments2 (id)
    ON UPDATE SET DEFAULT
    ON DELETE SET NULL
);

-- insert values into the tables

INSERT INTO departments2 (id, name) VALUES
    (1, 'Engineering'),
    (2, 'Marketing'),
    (404, 'Unknown')
RETURNING *;

INSERT INTO employees2 (full_name, age, department_id) VALUES
    ('John', 30, 1),
    ('Jane', 25, 2)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
Done.
Done.
3 rows affected.
2 rows affected.

[(1, 'John', 30, 1), (2, 'Jane', 25, 2)]

In [163]:
%%sql

-- let us try another mode
DELETE FROM departments2
WHERE id = 1
RETURNING *;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
2 rows affected.

[(2, 'Jane', 25, 2), (1, 'John', 30, None)]

In [164]:
%%sql

SELECT * FROM departments2;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(2, 'Marketing'), (404, 'Unknown')]

In [165]:
%%sql

-- let us try another mode
UPDATE departments2
SET id = 10
WHERE id = 2
RETURNING *;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
2 rows affected.

[(1, 'John', 30, None), (2, 'Jane', 25, 404)]

In [167]:
%%sql

-- ADD a new column into a table 
ALTER TABLE employees2
ADD COLUMN phone_number VARCHAR(20);

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.

[]

In [168]:
%%sql

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[(1, 'John', 30, None, None), (2, 'Jane', 25, 404, None)]

In [169]:
%%sql

-- ADD a new column into a table 
ALTER TABLE employees2
ADD COLUMN email VARCHAR(50) DEFAULT 'Unknown';

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
2 rows affected.

[(1, 'John', 30, None, None, 'Unknown'), (2, 'Jane', 25, 404, None, 'Unknown')]

In [174]:
%%sql

-- add constraints on a column in an existed table
ALTER TABLE employees2
ALTER COLUMN phone_number SET DEFAULT '404';

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
3 rows affected.

[(1, 'John', 30, None, None, 'Unknown'),
 (2, 'Jane', 25, 404, None, 'Unknown'),
 (3, None, 19, 404, '404', 'Unknown')]

In [172]:
%%sql
INSERT INTO employees2 (age)
VALUES 
    (19)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(3, None, 19, 404, '404', 'Unknown')]

In [176]:
%%sql

-- ALTER TABLE employees2
-- DROP COLUMN email;

UPDATE employees2
SET phone_number = 666;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.
3 rows affected.

[(1, 'John', 30, None, '666'),
 (2, 'Jane', 25, 404, '666'),
 (3, None, 19, 404, '666')]

In [180]:
%%sql

DROP TABLE IF EXISTS phone_numbers2;

CREATE TABLE phone_numbers2 (
    id SERIAL PRIMARY KEY,
    phone_number INT UNIQUE
);

INSERT INTO phone_numbers2 (id, phone_number)
VALUES
    (666, 123456)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
1 rows affected.

[(666, 123456)]

In [187]:
%%sql

ALTER TABLE employees2
ADD COLUMN phone_number_id INT;

UPDATE employees2
SET phone_number_id = 666;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.
3 rows affected.

[(1, 'John', 30, None, '666', 666),
 (2, 'Jane', 25, 404, '666', 666),
 (3, None, 19, 404, '666', 666)]

In [188]:
%%sql

ALTER TABLE employees2
ADD CONSTRAINT fk_phone_number
    FOREIGN KEY (phone_number_id)
    REFERENCES phone_numbers2(id);

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
3 rows affected.

[(1, 'John', 30, None, '666', 666),
 (2, 'Jane', 25, 404, '666', 666),
 (3, None, 19, 404, '666', 666)]

In [189]:
%%sql

UPDATE employees2
SET phone_number_id = 777
WHERE id = 1;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental

IntegrityError: (psycopg2.errors.ForeignKeyViolation) insert or update on table "employees2" violates foreign key constraint "fk_phone_number"
DETAIL:  Key (phone_number_id)=(777) is not present in table "phone_numbers2".

[SQL: UPDATE employees2
SET phone_number_id = 777
WHERE id = 1;]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [190]:
%%sql

INSERT INTO phone_numbers2 (id, phone_number)
VALUES
    (777, 345678);

UPDATE employees2
SET phone_number_id = 777
WHERE id = 1;

SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
1 rows affected.
1 rows affected.
3 rows affected.

[(2, 'Jane', 25, 404, '666', 666),
 (3, None, 19, 404, '666', 666),
 (1, 'John', 30, None, '666', 777)]

In [194]:
%%sql

-- DROP a column from a table 
-- ALTER TABLE employees2
-- DROP phone_number;

-- Select rows from a Tablemployees2' in schema 'SchemaName'
SELECT * FROM employees2;

 * postgresql://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(2, 'Jane', 25, 404, 666),
 (3, None, 19, 404, 666),
 (1, 'John', 30, None, 777)]

## Lec 8: Transactions in Database

In [53]:
%%sql

DROP TABLE IF EXISTS bank_accounts;

-- create a bank account system
CREATE TABLE bank_accounts(
    account_id VARCHAR(3) UNIQUE PRIMARY KEY,
    balance DECIMAL(10, 2) CHECK (balance >= 0)
);

INSERT INTO bank_accounts 
VALUES
    ('A', 1000),
    ('B', 500)
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
2 rows affected.

[('A', Decimal('1000.00')), ('B', Decimal('500.00'))]

In [25]:
%%sql

-- Start a transaction
BEGIN;

-- part A of the transaction
-- Debit from Account A
UPDATE bank_accounts
SET balance = balance - 100
WHERE account_id = 'A';

-- part B of the transaction
-- credit to account B
UPDATE bank_accounts
SET balance = balance + 100
WHERE account_id = 'B';

-- Commit the transaction
COMMIT;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
1 rows affected.

DataError: (psycopg2.errors.InvalidTextRepresentation) invalid input syntax for type numeric: "A"
LINE 4: SET balance = balance + 'A'
                                ^

[SQL: -- part B of the transaction
-- credit to account B
UPDATE bank_accounts
SET balance = balance + 'A'
WHERE account_id = 'B';]
(Background on this error at: https://sqlalche.me/e/14/9h9h)

In [16]:
%%sql

-- Select rows from a Tablbank_accounts' in schema 'SchemaName'
SELECT * FROM bank_accounts;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('A', Decimal('700.00')), ('B', Decimal('600.00'))]

In [44]:
%%sql

-- Start a transaction
BEGIN;

DO $$

-- define temporary variables
DECLARE 
    transfer_amount DECIMAL(10,2) := 150;
    account_a_balance DECIMAL(10,2);

-- start a unit of transaction
BEGIN

    -- part a of the trans
    UPDATE bank_accounts
    SET balance = balance - transfer_amount
    WHERE account_id = 'A';

    -- part b of the trans
    UPDATE bank_accounts
    SET balance = balance + transfer_amount
    WHERE account_id = 'B';

    -- Check for consistency, if not, rollback the transaction
    SELECT balance INTO account_a_balance 
    FROM bank_accounts 
    WHERE account_id = 'A';

    IF account_a_balance >= 0 
    THEN 
        -- Commit the transaction if consistent
        COMMIT;
    ELSE
        -- Rollback the transaction if inconsistent
        ROLLBACK;
    END IF;
END $$;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.

[]

In [45]:
%%sql 

SELECT * FROM bank_accounts;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('A', Decimal('0.00')), ('B', Decimal('1200.00'))]

In [58]:
%%sql

-- Start a transaction
BEGIN;

DO $$

-- define temporary variables
DECLARE 
    transfer_amount DECIMAL(10,2) := 150;
    account_a_balance DECIMAL(10,2);

-- start a unit of transaction
BEGIN

    -- part a of the trans
    UPDATE bank_accounts
    SET balance = balance - transfer_amount
    WHERE account_id = 'A';

    -- part b of the trans
    UPDATE bank_accounts
    SET balance = balance + transfer_amount
    WHERE account_id = 'B';

    -- Check for consistency, if not, rollback the transaction
    SELECT balance INTO account_a_balance 
    FROM bank_accounts 
    WHERE account_id = 'A';

    COMMIT;
END $$;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.

[]

In [59]:
%%sql 

SELECT * FROM bank_accounts;

 * postgresql://postgres:***@localhost:5432/dvdrental
2 rows affected.

[('A', Decimal('850.00')), ('B', Decimal('650.00'))]

### The ACID property for transaction operation in Database.

**Atomicity/atomic**

**Consistency**

**Isolation**

**Durability**

## Lec 9: Joins and subqueries in SQL

In [79]:
%%sql

DROP TABLE IF EXISTS student CASCADE;
CREATE TABLE student (
    student_id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50)
);

INSERT INTO student (first_name, last_name)
VALUES
    ('John', 'Doe'),
    ('Jane', 'Smith'),
    ('Alice', 'Johnson'),
    ('Bob', 'Brown')
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
4 rows affected.

[(1, 'John', 'Doe'),
 (2, 'Jane', 'Smith'),
 (3, 'Alice', 'Johnson'),
 (4, 'Bob', 'Brown')]

In [86]:
%%sql

DROP TABLE IF EXISTS course CASCADE;
CREATE TABLE course (
    course_id SERIAL PRIMARY KEY,
    student_id INT,
    course_name VARCHAR(100), 
    FOREIGN KEY (student_id) REFERENCES student(student_id)
);

INSERT INTO course (student_id, course_name) VALUES
(1, 'Mathematics'),
(2, 'Science'),
(3, 'History'),
(1, 'Literature')
RETURNING *;

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
4 rows affected.

[(1, 1, 'Mathematics'),
 (2, 2, 'Science'),
 (3, 3, 'History'),
 (4, 1, 'Literature')]

In [90]:
%%sql

-- Use INNER JOIN to combine tables together and SELECT tuples from it
SELECT course_id, course_name, first_name, last_name, s.student_id
FROM student AS s INNER JOIN course AS c
ON s.student_id = c.student_id;

 * postgresql://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(1, 'Mathematics', 'John', 'Doe', 1),
 (2, 'Science', 'Jane', 'Smith', 2),
 (3, 'History', 'Alice', 'Johnson', 3),
 (4, 'Literature', 'John', 'Doe', 1)]

In [92]:
%%sql

-- LEFT JOIN
SELECT s.student_id, first_name, course_name
FROM student AS s
LEFT JOIN course AS c
ON s.student_id = c.student_id;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'John', 'Mathematics'),
 (2, 'Jane', 'Science'),
 (3, 'Alice', 'History'),
 (1, 'John', 'Literature'),
 (4, 'Bob', None)]

In [94]:
%%sql

-- Full outer join 
SELECT s.student_id, s.last_name, c.course_name, c.student_id
FROM student AS s
FULL OUTER JOIN course AS c
ON s.student_id = c.student_id;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'Doe', 'Mathematics', 1),
 (2, 'Smith', 'Science', 2),
 (3, 'Johnson', 'History', 3),
 (1, 'Doe', 'Literature', 1),
 (4, 'Brown', None, None)]

In [95]:
%%sql
DROP TABLE IF EXISTS enrollment CASCADE;
CREATE TABLE enrollment (
    enrollment_id SERIAL PRIMARY KEY,
    student_id INT,
    course_id INT,
    enrollment_date DATE,
    FOREIGN KEY (student_id) REFERENCES student(student_id),
    FOREIGN KEY (course_id) REFERENCES course(course_id)
);

INSERT INTO enrollment (student_id, course_id, enrollment_date) VALUES
(1, 1, '2023-01-01'),
(2, 2, '2023-01-02'),
(3, 3, '2023-01-03'),
(1, 4, '2023-01-04');

 * postgresql://postgres:***@localhost:5432/dvdrental
Done.
Done.
4 rows affected.

[]

In [96]:
%%sql
SELECT * FROM enrollment;

 * postgresql://postgres:***@localhost:5432/dvdrental
4 rows affected.

[(1, 1, 1, datetime.date(2023, 1, 1)),
 (2, 2, 2, datetime.date(2023, 1, 2)),
 (3, 3, 3, datetime.date(2023, 1, 3)),
 (4, 1, 4, datetime.date(2023, 1, 4))]

In [98]:
%%sql

-- JOIN more than two tables
SELECT s.student_id, s.first_name, c.course_name, e.enrollment_date
FROM student AS s
LEFT JOIN course AS c
ON s.student_id = c.student_id
LEFT JOIN enrollment as e
ON c.course_id = e.course_id;

 * postgresql://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'John', 'Mathematics', datetime.date(2023, 1, 1)),
 (2, 'Jane', 'Science', datetime.date(2023, 1, 2)),
 (3, 'Alice', 'History', datetime.date(2023, 1, 3)),
 (1, 'John', 'Literature', datetime.date(2023, 1, 4)),
 (4, 'Bob', None, None)]

### Subqueries

Use subqueries in a complete query to combine multiple steps together and get reuslts.

In [108]:
%%sql

-- Select the customers' name where they have higher payment than the maximum payment paid
-- by who has the customer_id equal to 1.
SELECT first_name, last_name
FROM customer 
WHERE customer_id IN (
    SELECT customer_id
    FROM payment
    WHERE amount > (
        SELECT AVG(amount)
        FROM payment 
        WHERE customer_id = 1
    )
);

 * postgresql://postgres:***@localhost:5432/dvdrental
599 rows affected.

[('Jared', 'Ely'),
 ('Mary', 'Smith'),
 ('Patricia', 'Johnson'),
 ('Linda', 'Williams'),
 ('Barbara', 'Jones'),
 ('Elizabeth', 'Brown'),
 ('Jennifer', 'Davis'),
 ('Maria', 'Miller'),
 ('Susan', 'Wilson'),
 ('Margaret', 'Moore'),
 ('Dorothy', 'Taylor'),
 ('Lisa', 'Anderson'),
 ('Nancy', 'Thomas'),
 ('Karen', 'Jackson'),
 ('Betty', 'White'),
 ('Helen', 'Harris'),
 ('Sandra', 'Martin'),
 ('Donna', 'Thompson'),
 ('Carol', 'Garcia'),
 ('Ruth', 'Martinez'),
 ('Sharon', 'Robinson'),
 ('Michelle', 'Clark'),
 ('Laura', 'Rodriguez'),
 ('Sarah', 'Lewis'),
 ('Kimberly', 'Lee'),
 ('Deborah', 'Walker'),
 ('Jessica', 'Hall'),
 ('Shirley', 'Allen'),
 ('Cynthia', 'Young'),
 ('Angela', 'Hernandez')]

In [121]:
%%sql

-- select information where the customers have the payment larger than 
-- the average payment they have
SELECT payment_id, customer_id, amount, payment_date
FROM payment p1
WHERE amount >= (
    SELECT AVG(amount)
    FROM payment p2
    WHERE p2.customer_id = p1.customer_id
);

 * postgresql://postgres:***@localhost:5432/dvdrental
7307 rows affected.

[(17503, 341, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17505, 341, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17507, 341, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577)),
 (17508, 341, Decimal('5.99'), datetime.datetime(2007, 2, 21, 12, 33, 49, 996577)),
 (17509, 342, Decimal('5.99'), datetime.datetime(2007, 2, 17, 23, 58, 17, 996577)),
 (17510, 342, Decimal('5.99'), datetime.datetime(2007, 2, 20, 2, 11, 44, 996577)),
 (17512, 343, Decimal('4.99'), datetime.datetime(2007, 2, 16, 0, 10, 50, 996577)),
 (17513, 343, Decimal('6.99'), datetime.datetime(2007, 2, 16, 1, 15, 33, 996577)),
 (17516, 343, Decimal('6.99'), datetime.datetime(2007, 2, 18, 18, 26, 38, 996577)),
 (17517, 343, Decimal('8.99'), datetime.datetime(2007, 2, 20, 7, 3, 29, 996577)),
 (17520, 344, Decimal('4.99'), datetime.datetime(2007, 2, 15, 19, 36, 27, 996577)),
 (17523, 345, Decimal('4.99'), datetime.datetime(2007, 2, 15, 18, 34, 15, 996577)),
 (17525, 345, Decimal('4.99'), datetime.datetime(2007, 2, 19, 16, 13, 41, 996577)),
 (17526, 346, Decimal('5.99'), datetime.datetime(2007, 2, 17, 9, 35, 32, 996577)),
 (17529, 347, Decimal('8.99'), datetime.datetime(2007, 2, 16, 12, 40, 18, 996577)),
 (17531, 347, Decimal('4.99'), datetime.datetime(2007, 2, 20, 10, 16, 26, 996577)),
 (17532, 347, Decimal('8.99'), datetime.datetime(2007, 2, 20, 14, 33, 8, 996577)),
 (17533, 347, Decimal('7.99'), datetime.datetime(2007, 2, 21, 7, 33, 16, 996577)),
 (17535, 348, Decimal('8.99'), datetime.datetime(2007, 2, 17, 12, 47, 26, 996577)),
 (17539, 349, Decimal('6.99'), datetime.datetime(2007, 2, 20, 7, 24, 16, 996577)),
 (17540, 349, Decimal('8.99'), datetime.datetime(2007, 2, 20, 12, 27, 47, 996577)),
 (17541, 350, Decimal('3.99'), datetime.datetime(2007, 2, 17, 10, 24, 35, 996577)),
 (17545, 351, Decimal('5.99'), datetime.datetime(2007, 2, 16, 18, 33, 16, 996577)),
 (17549, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 7, 48, 59, 996577)),
 (17550, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 9, 36, 54, 996577)),
 (17551, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 17, 40, 11, 996577)),
 (17552, 352, Decimal('4.99'), datetime.datetime(2007, 2, 21, 8, 6, 19, 996577)),
 (17554, 353, Decimal('7.99'), datetime.datetime(2007, 2, 17, 5, 16, 57, 996577)),
 (17555, 353, Decimal('6.99'), datetime.datetime(2007, 2, 21, 1, 7, 57, 996577)),
 (17557, 354, Decimal('4.99'), datetime.datetime(2007, 2, 18, 4, 59, 55, 996577))]

In [122]:
%%sql

-- We can calculate their average payment individually and filter the tuples where
-- the amount larger than the average value
SELECT payment_id, p1.customer_id, amount, payment_date
FROM payment p1 
INNER JOIN (
    SELECT customer_id, AVG(amount) AS ave_amount
    FROM payment
    GROUP BY customer_id
) p2 ON p1.customer_id = p2.customer_id
WHERE amount >= ave_amount;

 * postgresql://postgres:***@localhost:5432/dvdrental
7307 rows affected.

[(17503, 341, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17505, 341, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17507, 341, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577)),
 (17508, 341, Decimal('5.99'), datetime.datetime(2007, 2, 21, 12, 33, 49, 996577)),
 (17509, 342, Decimal('5.99'), datetime.datetime(2007, 2, 17, 23, 58, 17, 996577)),
 (17510, 342, Decimal('5.99'), datetime.datetime(2007, 2, 20, 2, 11, 44, 996577)),
 (17512, 343, Decimal('4.99'), datetime.datetime(2007, 2, 16, 0, 10, 50, 996577)),
 (17513, 343, Decimal('6.99'), datetime.datetime(2007, 2, 16, 1, 15, 33, 996577)),
 (17516, 343, Decimal('6.99'), datetime.datetime(2007, 2, 18, 18, 26, 38, 996577)),
 (17517, 343, Decimal('8.99'), datetime.datetime(2007, 2, 20, 7, 3, 29, 996577)),
 (17520, 344, Decimal('4.99'), datetime.datetime(2007, 2, 15, 19, 36, 27, 996577)),
 (17523, 345, Decimal('4.99'), datetime.datetime(2007, 2, 15, 18, 34, 15, 996577)),
 (17525, 345, Decimal('4.99'), datetime.datetime(2007, 2, 19, 16, 13, 41, 996577)),
 (17526, 346, Decimal('5.99'), datetime.datetime(2007, 2, 17, 9, 35, 32, 996577)),
 (17529, 347, Decimal('8.99'), datetime.datetime(2007, 2, 16, 12, 40, 18, 996577)),
 (17531, 347, Decimal('4.99'), datetime.datetime(2007, 2, 20, 10, 16, 26, 996577)),
 (17532, 347, Decimal('8.99'), datetime.datetime(2007, 2, 20, 14, 33, 8, 996577)),
 (17533, 347, Decimal('7.99'), datetime.datetime(2007, 2, 21, 7, 33, 16, 996577)),
 (17535, 348, Decimal('8.99'), datetime.datetime(2007, 2, 17, 12, 47, 26, 996577)),
 (17539, 349, Decimal('6.99'), datetime.datetime(2007, 2, 20, 7, 24, 16, 996577)),
 (17540, 349, Decimal('8.99'), datetime.datetime(2007, 2, 20, 12, 27, 47, 996577)),
 (17541, 350, Decimal('3.99'), datetime.datetime(2007, 2, 17, 10, 24, 35, 996577)),
 (17545, 351, Decimal('5.99'), datetime.datetime(2007, 2, 16, 18, 33, 16, 996577)),
 (17549, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 7, 48, 59, 996577)),
 (17550, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 9, 36, 54, 996577)),
 (17551, 352, Decimal('4.99'), datetime.datetime(2007, 2, 16, 17, 40, 11, 996577)),
 (17552, 352, Decimal('4.99'), datetime.datetime(2007, 2, 21, 8, 6, 19, 996577)),
 (17554, 353, Decimal('7.99'), datetime.datetime(2007, 2, 17, 5, 16, 57, 996577)),
 (17555, 353, Decimal('6.99'), datetime.datetime(2007, 2, 21, 1, 7, 57, 996577)),
 (17557, 354, Decimal('4.99'), datetime.datetime(2007, 2, 18, 4, 59, 55, 996577))]

## Lec 10: Window functions

In [129]:
%%sql

-- ROW_NUMBER() function
SELECT customer_id, rental_date AS top3_rental_date, row_num 
FROM(
    SELECT 
        customer_id, 
        rental_date,
        ROW_NUMBER() OVER (
            PARTITION BY customer_id ORDER BY rental_date
        ) AS row_Num
    FROM rental )
WHERE row_num <= 3
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(1, datetime.datetime(2005, 5, 25, 11, 30, 37), 1),
 (1, datetime.datetime(2005, 5, 28, 10, 35, 23), 2),
 (1, datetime.datetime(2005, 6, 15, 0, 54, 12), 3),
 (2, datetime.datetime(2005, 5, 27, 0, 9, 24), 1),
 (2, datetime.datetime(2005, 6, 17, 20, 54, 58), 2),
 (2, datetime.datetime(2005, 7, 10, 6, 31, 24), 3),
 (3, datetime.datetime(2005, 5, 27, 17, 17, 9), 1),
 (3, datetime.datetime(2005, 5, 29, 22, 43, 55), 2),
 (3, datetime.datetime(2005, 6, 16, 1, 34, 5), 3),
 (4, datetime.datetime(2005, 6, 15, 9, 31, 28), 1)]

In [134]:
%%sql

SELECT 
    customer_id,
    rental_count,
    RANK() OVER (ORDER BY rental_count DESC) AS rank
FROM (
    SELECT 
        customer_id,
        COUNT(*) AS rental_count
    FROM 
        rental
    GROUP BY 
        customer_id
)
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(148, 46, 1),
 (526, 45, 2),
 (144, 42, 3),
 (236, 42, 3),
 (75, 41, 5),
 (469, 40, 6),
 (197, 40, 6),
 (137, 39, 8),
 (178, 39, 8),
 (468, 39, 8)]

In [133]:
%%sql

SELECT
    customer_id,
    rental_count,
    DENSE_RANK() OVER (ORDER BY rental_count DESC) AS dense_rank
FROM (
    SELECT 
        customer_id,
        COUNT(*) AS rental_count
    FROM rental
    GROUP BY 
        customer_id
)
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(148, 46, 1),
 (526, 45, 2),
 (144, 42, 3),
 (236, 42, 3),
 (75, 41, 4),
 (469, 40, 5),
 (197, 40, 5),
 (137, 39, 6),
 (178, 39, 6),
 (468, 39, 6)]

In [142]:
%%sql

SELECT 
    customer_id,
    rental_date,
    NTILE(4) OVER (PARTITION BY customer_id ORDER BY rental_date) AS quarter_rental
FROM rental
WHERE customer_id = 2
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(2, datetime.datetime(2005, 5, 27, 0, 9, 24), 1),
 (2, datetime.datetime(2005, 6, 17, 20, 54, 58), 1),
 (2, datetime.datetime(2005, 7, 10, 6, 31, 24), 1),
 (2, datetime.datetime(2005, 7, 10, 12, 38, 56), 1),
 (2, datetime.datetime(2005, 7, 27, 14, 30, 42), 1),
 (2, datetime.datetime(2005, 7, 27, 15, 23, 2), 1),
 (2, datetime.datetime(2005, 7, 27, 18, 40, 20), 1),
 (2, datetime.datetime(2005, 7, 29, 0, 12, 59), 2),
 (2, datetime.datetime(2005, 7, 29, 12, 56, 59), 2),
 (2, datetime.datetime(2005, 7, 29, 17, 14, 29), 2)]

In [147]:
%%sql

SELECT 
    customer_id,
    rental_id,
    rental_date,
    LAG(rental_date, 5) OVER (PARTITION BY customer_id ORDER BY rental_date)
    AS prev_rental_date,
    rental_date - LAG(rental_date,5) OVER (PARTITION BY customer_id ORDER BY rental_date)
    AS time_gap
FROM rental
WHERE customer_id = 1;

 * postgresql://postgres:***@localhost:5432/dvdrental
32 rows affected.

[(1, 76, datetime.datetime(2005, 5, 25, 11, 30, 37), None, None),
 (1, 573, datetime.datetime(2005, 5, 28, 10, 35, 23), None, None),
 (1, 1185, datetime.datetime(2005, 6, 15, 0, 54, 12), None, None),
 (1, 1422, datetime.datetime(2005, 6, 15, 18, 2, 53), None, None),
 (1, 1476, datetime.datetime(2005, 6, 15, 21, 8, 46), None, None),
 (1, 1725, datetime.datetime(2005, 6, 16, 15, 18, 57), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.timedelta(days=22, seconds=13700)),
 (1, 2308, datetime.datetime(2005, 6, 18, 8, 41, 48), datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.timedelta(days=20, seconds=79585)),
 (1, 2363, datetime.datetime(2005, 6, 18, 13, 33, 59), datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.timedelta(days=3, seconds=45587)),
 (1, 3284, datetime.datetime(2005, 6, 21, 6, 24, 45), datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.timedelta(days=5, seconds=44512)),
 (1, 4526, datetime.datetime(2005, 7, 8, 3, 17, 5), datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.timedelta(days=22, seconds=22099)),
 (1, 4611, datetime.datetime(2005, 7, 8, 7, 33, 56), datetime.datetime(2005, 6, 16, 15, 18, 57), datetime.timedelta(days=21, seconds=58499)),
 (1, 5244, datetime.datetime(2005, 7, 9, 13, 24, 7), datetime.datetime(2005, 6, 18, 8, 41, 48), datetime.timedelta(days=21, seconds=16939)),
 (1, 5326, datetime.datetime(2005, 7, 9, 16, 38, 1), datetime.datetime(2005, 6, 18, 13, 33, 59), datetime.timedelta(days=21, seconds=11042)),
 (1, 6163, datetime.datetime(2005, 7, 11, 10, 13, 46), datetime.datetime(2005, 6, 21, 6, 24, 45), datetime.timedelta(days=20, seconds=13741)),
 (1, 7273, datetime.datetime(2005, 7, 27, 11, 31, 22), datetime.datetime(2005, 7, 8, 3, 17, 5), datetime.timedelta(days=19, seconds=29657)),
 (1, 7841, datetime.datetime(2005, 7, 28, 9, 4, 45), datetime.datetime(2005, 7, 8, 7, 33, 56), datetime.timedelta(days=20, seconds=5449)),
 (1, 8033, datetime.datetime(2005, 7, 28, 16, 18, 23), datetime.datetime(2005, 7, 9, 13, 24, 7), datetime.timedelta(days=19, seconds=10456)),
 (1, 8074, datetime.datetime(2005, 7, 28, 17, 33, 39), datetime.datetime(2005, 7, 9, 16, 38, 1), datetime.timedelta(days=19, seconds=3338)),
 (1, 8116, datetime.datetime(2005, 7, 28, 19, 20, 7), datetime.datetime(2005, 7, 11, 10, 13, 46), datetime.timedelta(days=17, seconds=32781)),
 (1, 8326, datetime.datetime(2005, 7, 29, 3, 58, 49), datetime.datetime(2005, 7, 27, 11, 31, 22), datetime.timedelta(days=1, seconds=59247)),
 (1, 9571, datetime.datetime(2005, 7, 31, 2, 42, 18), datetime.datetime(2005, 7, 28, 9, 4, 45), datetime.timedelta(days=2, seconds=63453)),
 (1, 10437, datetime.datetime(2005, 8, 1, 8, 51, 4), datetime.datetime(2005, 7, 28, 16, 18, 23), datetime.timedelta(days=3, seconds=59561)),
 (1, 11299, datetime.datetime(2005, 8, 2, 15, 36, 52), datetime.datetime(2005, 7, 28, 17, 33, 39), datetime.timedelta(days=4, seconds=79393)),
 (1, 11367, datetime.datetime(2005, 8, 2, 18, 1, 38), datetime.datetime(2005, 7, 28, 19, 20, 7), datetime.timedelta(days=4, seconds=81691)),
 (1, 11824, datetime.datetime(2005, 8, 17, 12, 37, 54), datetime.datetime(2005, 7, 29, 3, 58, 49), datetime.timedelta(days=19, seconds=31145)),
 (1, 12250, datetime.datetime(2005, 8, 18, 3, 57, 29), datetime.datetime(2005, 7, 31, 2, 42, 18), datetime.timedelta(days=18, seconds=4511)),
 (1, 13068, datetime.datetime(2005, 8, 19, 9, 55, 16), datetime.datetime(2005, 8, 1, 8, 51, 4), datetime.timedelta(days=18, seconds=3852)),
 (1, 13176, datetime.datetime(2005, 8, 19, 13, 56, 54), datetime.datetime(2005, 8, 2, 15, 36, 52), datetime.timedelta(days=16, seconds=80402)),
 (1, 14762, datetime.datetime(2005, 8, 21, 23, 33, 57), datetime.datetime(2005, 8, 2, 18, 1, 38), datetime.timedelta(days=19, seconds=19939)),
 (1, 14825, datetime.datetime(2005, 8, 22, 1, 27, 57), datetime.datetime(2005, 8, 17, 12, 37, 54), datetime.timedelta(days=4, seconds=46203))]

In [150]:
%%sql

SELECT 
    customer_id,
    rental_date,
    LEAD(rental_date, 1) OVER (PARTITION BY customer_id ORDER BY rental_date)
    AS ahead_rental_date,
    (
    LEAD(rental_date, 1) OVER (PARTITION BY customer_id ORDER BY rental_date)
     - rental_date
    ) AS time_gap_for_next_rental 
FROM rental
WHERE customer_id = 1;

 * postgresql://postgres:***@localhost:5432/dvdrental
32 rows affected.

[(1, datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.timedelta(days=2, seconds=83086)),
 (1, datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.timedelta(days=17, seconds=51529)),
 (1, datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.timedelta(seconds=61721)),
 (1, datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.timedelta(seconds=11153)),
 (1, datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.datetime(2005, 6, 16, 15, 18, 57), datetime.timedelta(seconds=65411)),
 (1, datetime.datetime(2005, 6, 16, 15, 18, 57), datetime.datetime(2005, 6, 18, 8, 41, 48), datetime.timedelta(days=1, seconds=62571)),
 (1, datetime.datetime(2005, 6, 18, 8, 41, 48), datetime.datetime(2005, 6, 18, 13, 33, 59), datetime.timedelta(seconds=17531)),
 (1, datetime.datetime(2005, 6, 18, 13, 33, 59), datetime.datetime(2005, 6, 21, 6, 24, 45), datetime.timedelta(days=2, seconds=60646)),
 (1, datetime.datetime(2005, 6, 21, 6, 24, 45), datetime.datetime(2005, 7, 8, 3, 17, 5), datetime.timedelta(days=16, seconds=75140)),
 (1, datetime.datetime(2005, 7, 8, 3, 17, 5), datetime.datetime(2005, 7, 8, 7, 33, 56), datetime.timedelta(seconds=15411)),
 (1, datetime.datetime(2005, 7, 8, 7, 33, 56), datetime.datetime(2005, 7, 9, 13, 24, 7), datetime.timedelta(days=1, seconds=21011)),
 (1, datetime.datetime(2005, 7, 9, 13, 24, 7), datetime.datetime(2005, 7, 9, 16, 38, 1), datetime.timedelta(seconds=11634)),
 (1, datetime.datetime(2005, 7, 9, 16, 38, 1), datetime.datetime(2005, 7, 11, 10, 13, 46), datetime.timedelta(days=1, seconds=63345)),
 (1, datetime.datetime(2005, 7, 11, 10, 13, 46), datetime.datetime(2005, 7, 27, 11, 31, 22), datetime.timedelta(days=16, seconds=4656)),
 (1, datetime.datetime(2005, 7, 27, 11, 31, 22), datetime.datetime(2005, 7, 28, 9, 4, 45), datetime.timedelta(seconds=77603)),
 (1, datetime.datetime(2005, 7, 28, 9, 4, 45), datetime.datetime(2005, 7, 28, 16, 18, 23), datetime.timedelta(seconds=26018)),
 (1, datetime.datetime(2005, 7, 28, 16, 18, 23), datetime.datetime(2005, 7, 28, 17, 33, 39), datetime.timedelta(seconds=4516)),
 (1, datetime.datetime(2005, 7, 28, 17, 33, 39), datetime.datetime(2005, 7, 28, 19, 20, 7), datetime.timedelta(seconds=6388)),
 (1, datetime.datetime(2005, 7, 28, 19, 20, 7), datetime.datetime(2005, 7, 29, 3, 58, 49), datetime.timedelta(seconds=31122)),
 (1, datetime.datetime(2005, 7, 29, 3, 58, 49), datetime.datetime(2005, 7, 31, 2, 42, 18), datetime.timedelta(days=1, seconds=81809)),
 (1, datetime.datetime(2005, 7, 31, 2, 42, 18), datetime.datetime(2005, 8, 1, 8, 51, 4), datetime.timedelta(days=1, seconds=22126)),
 (1, datetime.datetime(2005, 8, 1, 8, 51, 4), datetime.datetime(2005, 8, 2, 15, 36, 52), datetime.timedelta(days=1, seconds=24348)),
 (1, datetime.datetime(2005, 8, 2, 15, 36, 52), datetime.datetime(2005, 8, 2, 18, 1, 38), datetime.timedelta(seconds=8686)),
 (1, datetime.datetime(2005, 8, 2, 18, 1, 38), datetime.datetime(2005, 8, 17, 12, 37, 54), datetime.timedelta(days=14, seconds=66976)),
 (1, datetime.datetime(2005, 8, 17, 12, 37, 54), datetime.datetime(2005, 8, 18, 3, 57, 29), datetime.timedelta(seconds=55175)),
 (1, datetime.datetime(2005, 8, 18, 3, 57, 29), datetime.datetime(2005, 8, 19, 9, 55, 16), datetime.timedelta(days=1, seconds=21467)),
 (1, datetime.datetime(2005, 8, 19, 9, 55, 16), datetime.datetime(2005, 8, 19, 13, 56, 54), datetime.timedelta(seconds=14498)),
 (1, datetime.datetime(2005, 8, 19, 13, 56, 54), datetime.datetime(2005, 8, 21, 23, 33, 57), datetime.timedelta(days=2, seconds=34623)),
 (1, datetime.datetime(2005, 8, 21, 23, 33, 57), datetime.datetime(2005, 8, 22, 1, 27, 57), datetime.timedelta(seconds=6840)),
 (1, datetime.datetime(2005, 8, 22, 1, 27, 57), datetime.datetime(2005, 8, 22, 19, 41, 37), datetime.timedelta(seconds=65620))]

In [160]:
%%sql

SELECT 
    customer_id,
    rental_date,
    LEAD(rental_date, 1) OVER 
    (PARTITION BY customer_id ORDER BY rental_date)
    AS ahead_day
FROM rental;

 * postgresql://postgres:***@localhost:5432/dvdrental
16044 rows affected.

[(1, datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2005, 5, 28, 10, 35, 23)),
 (1, datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.datetime(2005, 6, 15, 0, 54, 12)),
 (1, datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.datetime(2005, 6, 15, 18, 2, 53)),
 (1, datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.datetime(2005, 6, 15, 21, 8, 46)),
 (1, datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.datetime(2005, 6, 16, 15, 18, 57)),
 (1, datetime.datetime(2005, 6, 16, 15, 18, 57), datetime.datetime(2005, 6, 18, 8, 41, 48)),
 (1, datetime.datetime(2005, 6, 18, 8, 41, 48), datetime.datetime(2005, 6, 18, 13, 33, 59)),
 (1, datetime.datetime(2005, 6, 18, 13, 33, 59), datetime.datetime(2005, 6, 21, 6, 24, 45)),
 (1, datetime.datetime(2005, 6, 21, 6, 24, 45), datetime.datetime(2005, 7, 8, 3, 17, 5)),
 (1, datetime.datetime(2005, 7, 8, 3, 17, 5), datetime.datetime(2005, 7, 8, 7, 33, 56)),
 (1, datetime.datetime(2005, 7, 8, 7, 33, 56), datetime.datetime(2005, 7, 9, 13, 24, 7)),
 (1, datetime.datetime(2005, 7, 9, 13, 24, 7), datetime.datetime(2005, 7, 9, 16, 38, 1)),
 (1, datetime.datetime(2005, 7, 9, 16, 38, 1), datetime.datetime(2005, 7, 11, 10, 13, 46)),
 (1, datetime.datetime(2005, 7, 11, 10, 13, 46), datetime.datetime(2005, 7, 27, 11, 31, 22)),
 (1, datetime.datetime(2005, 7, 27, 11, 31, 22), datetime.datetime(2005, 7, 28, 9, 4, 45)),
 (1, datetime.datetime(2005, 7, 28, 9, 4, 45), datetime.datetime(2005, 7, 28, 16, 18, 23)),
 (1, datetime.datetime(2005, 7, 28, 16, 18, 23), datetime.datetime(2005, 7, 28, 17, 33, 39)),
 (1, datetime.datetime(2005, 7, 28, 17, 33, 39), datetime.datetime(2005, 7, 28, 19, 20, 7)),
 (1, datetime.datetime(2005, 7, 28, 19, 20, 7), datetime.datetime(2005, 7, 29, 3, 58, 49)),
 (1, datetime.datetime(2005, 7, 29, 3, 58, 49), datetime.datetime(2005, 7, 31, 2, 42, 18)),
 (1, datetime.datetime(2005, 7, 31, 2, 42, 18), datetime.datetime(2005, 8, 1, 8, 51, 4)),
 (1, datetime.datetime(2005, 8, 1, 8, 51, 4), datetime.datetime(2005, 8, 2, 15, 36, 52)),
 (1, datetime.datetime(2005, 8, 2, 15, 36, 52), datetime.datetime(2005, 8, 2, 18, 1, 38)),
 (1, datetime.datetime(2005, 8, 2, 18, 1, 38), datetime.datetime(2005, 8, 17, 12, 37, 54)),
 (1, datetime.datetime(2005, 8, 17, 12, 37, 54), datetime.datetime(2005, 8, 18, 3, 57, 29)),
 (1, datetime.datetime(2005, 8, 18, 3, 57, 29), datetime.datetime(2005, 8, 19, 9, 55, 16)),
 (1, datetime.datetime(2005, 8, 19, 9, 55, 16), datetime.datetime(2005, 8, 19, 13, 56, 54)),
 (1, datetime.datetime(2005, 8, 19, 13, 56, 54), datetime.datetime(2005, 8, 21, 23, 33, 57)),
 (1, datetime.datetime(2005, 8, 21, 23, 33, 57), datetime.datetime(2005, 8, 22, 1, 27, 57)),
 (1, datetime.datetime(2005, 8, 22, 1, 27, 57), datetime.datetime(2005, 8, 22, 19, 41, 37))]

In [155]:
%%sql

SELECT * FROM rental
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
10 rows affected.

[(100, datetime.datetime(2005, 5, 25, 16, 50, 28), 2599, 208, datetime.datetime(2005, 6, 2, 22, 11, 28), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (101, datetime.datetime(2005, 5, 25, 17, 17, 4), 617, 468, datetime.datetime(2005, 5, 31, 19, 47, 4), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (102, datetime.datetime(2005, 5, 25, 17, 22, 10), 373, 343, datetime.datetime(2005, 5, 31, 19, 47, 10), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (103, datetime.datetime(2005, 5, 25, 17, 30, 42), 3343, 384, datetime.datetime(2005, 6, 3, 22, 36, 42), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (104, datetime.datetime(2005, 5, 25, 17, 46, 33), 4281, 310, datetime.datetime(2005, 5, 27, 15, 20, 33), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (105, datetime.datetime(2005, 5, 25, 17, 54, 12), 794, 108, datetime.datetime(2005, 5, 30, 12, 3, 12), 2, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (106, datetime.datetime(2005, 5, 25, 18, 18, 19), 3627, 196, datetime.datetime(2005, 6, 4, 0, 1, 19), 2, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (107, datetime.datetime(2005, 5, 25, 18, 28, 9), 2833, 317, datetime.datetime(2005, 6, 3, 22, 46, 9), 2, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (108, datetime.datetime(2005, 5, 25, 18, 30, 5), 3289, 242, datetime.datetime(2005, 5, 30, 19, 40, 5), 1, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      '),
 (109, datetime.datetime(2005, 5, 25, 18, 40, 20), 1044, 503, datetime.datetime(2005, 5, 29, 20, 39, 20), 2, datetime.datetime(2024, 9, 20, 21, 58, 19, 700311), 'May      ')]

In [177]:
%%sql

SELECT 
    customer_id,
    payment_date,
    SUM(amount) OVER (PARTITION BY customer_id ORDER BY payment_date) AS total_payment
FROM payment
WHERE customer_id = 1;

 * postgresql://postgres:***@localhost:5432/dvdrental
30 rows affected.

[(1, datetime.datetime(2007, 2, 14, 23, 22, 38, 996577), Decimal('5.99')),
 (1, datetime.datetime(2007, 2, 15, 16, 31, 19, 996577), Decimal('6.98')),
 (1, datetime.datetime(2007, 2, 15, 19, 37, 12, 996577), Decimal('16.97')),
 (1, datetime.datetime(2007, 2, 16, 13, 47, 23, 996577), Decimal('21.96')),
 (1, datetime.datetime(2007, 2, 18, 7, 10, 14, 996577), Decimal('26.95')),
 (1, datetime.datetime(2007, 2, 18, 12, 2, 25, 996577), Decimal('27.94')),
 (1, datetime.datetime(2007, 2, 21, 4, 53, 11, 996577), Decimal('31.93')),
 (1, datetime.datetime(2007, 3, 1, 7, 19, 30, 996577), Decimal('36.92')),
 (1, datetime.datetime(2007, 3, 2, 14, 5, 18, 996577), Decimal('40.91')),
 (1, datetime.datetime(2007, 3, 2, 16, 30, 4, 996577), Decimal('41.90')),
 (1, datetime.datetime(2007, 3, 17, 11, 6, 20, 996577), Decimal('46.89')),
 (1, datetime.datetime(2007, 3, 18, 2, 25, 55, 996577), Decimal('47.88')),
 (1, datetime.datetime(2007, 3, 19, 8, 23, 42, 996577), Decimal('48.87')),
 (1, datetime.datetime(2007, 3, 19, 12, 25, 20, 996577), Decimal('51.86')),
 (1, datetime.datetime(2007, 3, 21, 22, 2, 23, 996577), Decimal('52.85')),
 (1, datetime.datetime(2007, 3, 21, 23, 56, 23, 996577), Decimal('54.84')),
 (1, datetime.datetime(2007, 3, 22, 18, 10, 3, 996577), Decimal('57.83')),
 (1, datetime.datetime(2007, 3, 22, 18, 32, 12, 996577), Decimal('63.82')),
 (1, datetime.datetime(2007, 4, 8, 1, 45, 31, 996577), Decimal('69.81')),
 (1, datetime.datetime(2007, 4, 8, 6, 2, 22, 996577), Decimal('75.80')),
 (1, datetime.datetime(2007, 4, 9, 11, 52, 33, 996577), Decimal('80.79')),
 (1, datetime.datetime(2007, 4, 9, 15, 6, 27, 996577), Decimal('85.78')),
 (1, datetime.datetime(2007, 4, 11, 8, 42, 12, 996577), Decimal('93.77')),
 (1, datetime.datetime(2007, 4, 27, 9, 59, 48, 996577), Decimal('96.76')),
 (1, datetime.datetime(2007, 4, 28, 7, 33, 11, 996577), Decimal('101.75')),
 (1, datetime.datetime(2007, 4, 28, 14, 46, 49, 996577), Decimal('106.74')),
 (1, datetime.datetime(2007, 4, 28, 16, 2, 5, 996577), Decimal('107.73')),
 (1, datetime.datetime(2007, 4, 28, 17, 48, 33, 996577), Decimal('108.72')),
 (1, datetime.datetime(2007, 4, 29, 2, 27, 15, 996577), Decimal('111.71')),
 (1, datetime.datetime(2007, 4, 30, 1, 10, 44, 996577), Decimal('114.70'))]

In [183]:
%%sql

SELECT 
    customer_id,
    SUM(amount) AS partial_amount,
    partions
FROM(
    SELECT 
        customer_id,
        payment_date,
        amount,
        NTILE(6) OVER (PARTITION BY customer_id ORDER BY payment_date) as partions
    FROM payment
    WHERE customer_id = 1
    )
GROUP BY partions, customer_id
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/dvdrental
6 rows affected.

[(1, Decimal('26.95'), 1),
 (1, Decimal('14.95'), 2),
 (1, Decimal('10.95'), 3),
 (1, Decimal('22.95'), 4),
 (1, Decimal('25.95'), 5),
 (1, Decimal('12.95'), 6)]

In [178]:
%%sql

SELECT 
    customer_id,
    payment_date,
    amount,
    NTILE(6) OVER (PARTITION BY customer_id ORDER BY payment_date)
FROM payment
WHERE customer_id = 1;

 * postgresql://postgres:***@localhost:5432/dvdrental
30 rows affected.

[(1, datetime.datetime(2007, 2, 14, 23, 22, 38, 996577), Decimal('5.99'), 1),
 (1, datetime.datetime(2007, 2, 15, 16, 31, 19, 996577), Decimal('0.99'), 1),
 (1, datetime.datetime(2007, 2, 15, 19, 37, 12, 996577), Decimal('9.99'), 1),
 (1, datetime.datetime(2007, 2, 16, 13, 47, 23, 996577), Decimal('4.99'), 1),
 (1, datetime.datetime(2007, 2, 18, 7, 10, 14, 996577), Decimal('4.99'), 1),
 (1, datetime.datetime(2007, 2, 18, 12, 2, 25, 996577), Decimal('0.99'), 2),
 (1, datetime.datetime(2007, 2, 21, 4, 53, 11, 996577), Decimal('3.99'), 2),
 (1, datetime.datetime(2007, 3, 1, 7, 19, 30, 996577), Decimal('4.99'), 2),
 (1, datetime.datetime(2007, 3, 2, 14, 5, 18, 996577), Decimal('3.99'), 2),
 (1, datetime.datetime(2007, 3, 2, 16, 30, 4, 996577), Decimal('0.99'), 2),
 (1, datetime.datetime(2007, 3, 17, 11, 6, 20, 996577), Decimal('4.99'), 3),
 (1, datetime.datetime(2007, 3, 18, 2, 25, 55, 996577), Decimal('0.99'), 3),
 (1, datetime.datetime(2007, 3, 19, 8, 23, 42, 996577), Decimal('0.99'), 3),
 (1, datetime.datetime(2007, 3, 19, 12, 25, 20, 996577), Decimal('2.99'), 3),
 (1, datetime.datetime(2007, 3, 21, 22, 2, 23, 996577), Decimal('0.99'), 3),
 (1, datetime.datetime(2007, 3, 21, 23, 56, 23, 996577), Decimal('1.99'), 4),
 (1, datetime.datetime(2007, 3, 22, 18, 10, 3, 996577), Decimal('2.99'), 4),
 (1, datetime.datetime(2007, 3, 22, 18, 32, 12, 996577), Decimal('5.99'), 4),
 (1, datetime.datetime(2007, 4, 8, 1, 45, 31, 996577), Decimal('5.99'), 4),
 (1, datetime.datetime(2007, 4, 8, 6, 2, 22, 996577), Decimal('5.99'), 4),
 (1, datetime.datetime(2007, 4, 9, 11, 52, 33, 996577), Decimal('4.99'), 5),
 (1, datetime.datetime(2007, 4, 9, 15, 6, 27, 996577), Decimal('4.99'), 5),
 (1, datetime.datetime(2007, 4, 11, 8, 42, 12, 996577), Decimal('7.99'), 5),
 (1, datetime.datetime(2007, 4, 27, 9, 59, 48, 996577), Decimal('2.99'), 5),
 (1, datetime.datetime(2007, 4, 28, 7, 33, 11, 996577), Decimal('4.99'), 5),
 (1, datetime.datetime(2007, 4, 28, 14, 46, 49, 996577), Decimal('4.99'), 6),
 (1, datetime.datetime(2007, 4, 28, 16, 2, 5, 996577), Decimal('0.99'), 6),
 (1, datetime.datetime(2007, 4, 28, 17, 48, 33, 996577), Decimal('0.99'), 6),
 (1, datetime.datetime(2007, 4, 29, 2, 27, 15, 996577), Decimal('2.99'), 6),
 (1, datetime.datetime(2007, 4, 30, 1, 10, 44, 996577), Decimal('2.99'), 6)]